{
	"projects": [{
			"index": "stockgrok",
			"name": "Stockgrok",
			"url": "",
			"demo":"http://stockgrok.github.io/prototype/",
			"otherbig":"<img class=\"dropshadow\" width=\"100%;\" src=\"../img/bloomberg/stockgrok.png\">",
			"video":"",
			"description": "",
			"cover": "img\/covers\/stockgrok.png",
			"tags":"Stock application for people with visual impairments.",
			"role":"Prototyping and Development Lead",
			"previous":"",
			"client": "Bloomberg LP",
			"next":"",
			"year":"",
			"filters":"",
			"featured":"",
			"color":"#20303E",
			"duration":"9 months",
			"brief":"Stockgrok aims to help people with visual impairments make better investment decisions. Stockgrok is the final product of my team’s 9 month <a href=\"mhci-capstone-+-bloomberg-lp.html\">capstone project with client Bloomberg LP</a>.",
			"content1":"<div class=\"left\"><h1>What is Stockgrok?</h1></div><div class=\"right\"><p>Stockgrok is a web application that sonifies the relationship between the price and a study or analysis over time. For the sake of our prototype, Stockgrok specifically sonifies the relationship of the price to the 50 Day Simple Moving Average over time. To sonify this data, we map the value of difference between the study and price to a pitch, or how high or low the note is. To identify which line is on top we use different timbres, or the quality of tone. When the price is above the simple moving average, the tone is brassy whereas when it is below the simple moving average it sounds more like it is under water. Different stocks can be accessed by inputting the corresponding ticker name. By turning off the simple moving average, users can also hear the price alone over time.</p></div>",
			"content2":"<div class=\"left\"><h1>Navigation</h1></div><div class=\"right\"><p>Users navigate Stockgrok using a screen reader and a series of hot keys. We tested Stockgrok with many users to make it as accessible as possibleIn an ideal future, these shortcuts would be completely customizable. <br><br><table class=\"inline-table\" style=\"width:100%\"><tbody><tr><td>g</td><td>Traverse left</td> </tr><tr> <td>H</td><td>Traverse right</td></tr><tr> <td>Comma</td><td>Jump to beginning</td></tr><tr> <td>Period</td><td>Jump to end</td></tr><tr> <td>L</td><td>Skip to previous intersection point</td></tr><tr> <td>Semicolon</td><td>Skip to next intersection point</td></tr><tr> <td>O</td><td>Jump to previous month</td></tr><tr> <td>P</td><td>Jump to next month</td></tr><tr> <td>Dash</td><td>Decrease screen reader speed</td></tr><tr> <td>Equals</td><td>Increase screen reader speed</td></tr><tr> <td>Space</td><td>Get details</td></tr></tbody></table></p></div>",
			"content3":"<div class=\"left\"><h1>Why Stockgrok?</h1></div><div class=\"right\"><p>We built Stockgrok as a web-based product so that it could be easily accessible on any operating system, and eventually across platforms (desktop, phone, tablet. etc.). We user-tested our final product with both people with visual impairment and sighted finance experts, and found that both were able to pick up on nonvisual cues about the changing trends in a security’s price history. We believe that this product will allow our users to make more meaningful financial decisions.</p></div>",
			"content4":"<div class=\"left\"><h1>Prototyping process</h1></div><div class=\"right\"><p>Coming soon...</p></div>",
			"content5":"<div class=\"left\"><h1></h1></div><div class=\"right\"><p></p></div>",
			"content6":"<div class=\"left\"><h1></h1></div><div class=\"right\"><p></p></div>",
			"section":"",
			"rec1":"",
			"rec2":""
		},{
			"index": "datavis",
			"name": "Blissful Careers",
			"url": "",
			"demo": "../datavis",
			"otherbig":"<img width=\"100%;\" src=\"../img/datavis.png\">",
			"description":"",
			"cover": "img\/covers\/datavis.png",
			"tags":"Three.js and D3.js data visualization to explore company bliss scores.",
			"previous":"",
			"client": "CMU",
			"next":"",
			"year":"2017",
			"filters":"ux-design interaction-design emerging-tech",
			"featured":"none",
			"color":"#8ca650",
			"duration":"2 Months",
			"brief":"This is a data visualization / exploration tool to enable the discovery of different factors contributing to companies \"Bliss Scores.\" This was created as an individual final project for a Data Visualization course at CMU.",
			"content1":"<div class=\"left\"><h1>Motivation and Objectives</h1></div> <div class=\"right\"><p>Before this project, I been spending a lot of time trying to figure out where I want to work after finishing school. With so many variables, I found it hard to assess the value and reliability of rankings.<br><Br>I decided to explore the CareerBliss 50 Happiest Companies over the last 5 years to see if I could suss out any insights.</p></div>",
			"content2":"<div class=\"left\"><h1>Data Sets</h1></div> <div class=\"right\"><p><ol><li>Bliss Scores from CareerBliss</li><li>Global RepTrak Scores from the Reputation Institute</li><li>Company Glass Door Data</li></ol></p></div>",
			"content3":"<div class=\"left\"><h1>Research Findings</h1></div> <div class=\"right\"><p>After gathering the data in Excel, I made some initial basic graphs and charts to see if I could find and significant trends or other areas of interest.<br><Br>Of the charts I explored, the bubble charts of the Happiness in relation to Salary and the Line graphs of the rankings over time were the most interesting, but due to the amount of data, they were very hard to read.<br><Br><img class=\"nodrop modalize\" src =\"../img/datavis/datavis1.png\"><br><br><img class=\"nodrop modalize\" src =\"../img/datavis/datavis2.png\"><br><br>From this exploration I settled on a new goal: <b>use 3D to make exploring bubble and line graphs together easier in the context of happiness rankings.</b></p></div>",
			"content4":"<div class=\"left\"><h1>Initial Implementation</h1></div> <div class=\"right\"><p>Visualization Tool: Unity3D<br><br>Initially I wanted to create a physical space where users could walk around and explore the data using Unity and the HTC Vive, but I ran into two major issues:<br><br>1) Even though the HTC Vive is a high end VR system, there is still a lot of aliasing on text, making it hard to read large amounts of data<br><br>2) I ran out of real estate quickly. In trying to make the text readable and positioned in logical places for the user to read it, I ran out of places to put information.<br><br><img class=\"nodrop modalize\" src =\"../img/datavis/datavis3.png\"><br><br><img class=\"nodrop modalize\" src =\"../img/datavis/datavis4.png\"></p></div>",
			"content5":"<div class=\"left\"><h1>Final Implementation</h1></div> <div class=\"right\"><p>Visualization Tools: D3 + Three.js<br><br>First, I explored different attributes for the z-axis, the biggest power up of doing the visualization in 3D. What I found is that most of the data that had 2 axes of similarity also had a third, making the increase in readability low.<br><br><img class=\"nodrop modalize\" src=\"../img/datavis/datavis5.png\"><br><br>So instead I used three.js to show a bubble chart of salary and bliss rating with a randomized z-axis for increased readability. I then used D3 to show a line graph of the company’s rank over time in 2D.</p></div>",
			"content6":"<div class=\"left\"><h1>Functionality</h1></div> <div class=\"right\"><p>View working demo <a href=\"../datavis\">here</a><br><br>By clicking on bubbles in either graph, the bubble and the corresponding bubble in the other graph will highlight. Selecting the year in the dropdown on the bubble chart will change the year view, selecting a bubble in a different year column on the line graph will also change the year view. Selecting a different option from the view dropdown will change the perspective. Any company selection will change the corresponding data at the bottom of the page.<br><br><img class=\"modalize nodrop\" src=\"../img/datavis/key.png\"> </p></div>",
			"content7":"<div class=\"left\"><h1>Future Directions</h1></div> <div class=\"right\"><p>If I were to continue the project, I would like to make the visualization responsive on resize, add filters to scope down the data, and add important news stories that may inform the rankings.</p></div>",
			"section":"",
			"rec1":"",
			"rec2":""
		},{
			"index": "maisy",
			"name": "Maisy Mouse AR",
			"url": "https:\/\/www.behance.net\/gallery\/47333721\/Maisy-Mouse-AR",
			"video":"<iframe width=\"100%\" src=\"https://www.youtube.com/embed/VQLr3wcSa_U\" frameborder=\"0\" allowfullscreen></iframe>",
			"description":"<p><br><br>I took a beloved childhood book and thought about how I could give it new life through adding new stories in augmented reality. The application has two parts: the scavenger hunt and the AR playroom.<br><br> The scavenger hunt portion of the application gives users hints and asks them to find and click on different items throughout Maisy's house. To create this, I created Vuforia image targets of items throughout the pop-up book and created corresponding After Effects animations that are played when the image target is in view.<br><br>For the playroom, I surveyed many of Cousins’s books and created different scenes for Maisy and her friends to play in. The purpose of this was to link the many of Cousins’s books to the pop-up books so that users get excited about reading the books and apply what they read about to their playtime. I also created an AR marker for Maisy and one for her friend. By tapping on Maisy, users can cycle between the scene. When this happens, both Maisy and her friends’ costumes change to fit the scene.<\/p>",
			"cover": "img\/covers\/maisy.png",
			"tags":"Augmented reality experience designed to encourage reading. ",
			"previous":"",
			"client": "CMU",
			"next":"",
			"year":"2016",
			"filters":"development emerging-tech ux-design vis-design interaction-design",
			"featured":"inline",
			"color":"#e41e2e",
			"demos":"CMU Design Showcase",
			"duration":"2 Months",
			"brief":"This is an augmented reality scavenger hunt and playroom for Maisy's Pop-up Playhouse by Lucy Cousins made using Unity and Vuforia.",
			"content1":"<div class=\"left\"><h1>About this project</h1></div> <div class=\"right\"><p>I took a beloved childhood book and thought about how I could give it new life through adding new stories in augmented reality. The application has two parts: the scavenger hunt and the AR playroom.</p></div>",
			"content2":"<div class=\"left\"><h1>Scavenger Hunt</h1></div><div class=\"right\"><p>The scavenger hunt portion of the application gives users hints and asks them to find and click on different items throughout Maisy's house. To create this, I created Vuforia image targets of items throughout the pop-up book and created corresponding After Effects animations that are played when the image target is in view.<br><br> <i>I’m something that is often round, But I’m not a pizza base, I have hands but don’t have fingers, And have numbers on my face</i><br><br> <img class=\"modalize\" src=\"../img/maisy/gif1.gif\"><br><br><i>This is something found throughout the house, Of that you can be very certain, Made of glass so you can see through it, But this one is covered by a curtain</i><br><br><img class=\"modalize\" src=\"../img/maisy/gif2.gif\"><br><br><i>If you want to be a pirate, You will need this without fail, So that you can travel around, You need something you can sail</i><br><br><img class=\"modalize\" src=\"../img/maisy/gif3.gif\"><br><br><i>This is where items can be stored, So your bedroom’s not a mess, It’s also where things get hung up, Like shirts, jackets or a dress</i><br><br><img class=\"modalize\" src=\"../img/maisy/gif4.gif\"></p></div>",
			"content3":"<div class=\"left\"><h1>Playroom</h1></div><div class=\"right\"><p>For the playroom, I surveyed many of Cousins’s books and created different scenes for Maisy and her friends to play in. The purpose of this was to link the many of Cousins’s books to the pop-up books so that users get excited about reading the books and apply what they read about to their playtime. I also created an AR marker for Maisy and one for her friend. By tapping on Maisy, users can cycle between the scene. When this happens, both Maisy and her friends’ costumes change to fit the scene. <br><br><img class=\"modalize\" src=\"../img/maisy/gif5.gif\"><br><br><img class=\"modalize\" src=\"../img/maisy/gif6.gif\"></p></div>",
			"content4":"<div class=\"left\"><h1>CMU Design Showcase</h1></div><div class=\"right\"><p><img src=\"../img/maisy1.jpg\" class=\"modalize\"><br><br><img src=\"../img/maisy2.jpg\" class=\"modalize\"></p></div>",
			"section":"",
			"rec1":"",
			"rec2":""
		}, {
			"index": "holidaycard",
			"name": "360 Holiday Card",
			"url": "https:\/\/www.behance.net\/gallery\/47077635\/360-Holiday-Card",
			"otherbig":"<center><a target=\"_blank\" href=\"../christmas2016/desktop.html\"><img class=\"threesixty\"src=\"../img/cardlinks1.png\" target=\"_blank\"></a><a target=\"_blank\" href=\"../christmas2016/mobile.html\"><img class=\"threesixty\"src=\"../img/cardlinks2.png\" target=\"_blank\"></a></center>",
			"description": "<p> The prompt was to scope a web-based project that would take three weeks to build and include course topics.<br><br>I used three.js to create a holiday card to send to my family and friends using 360 photos I had taken throughout the year.<br><br>The primary class topic I focused on was library extension. Three.js has a lathe geometry object which takes a set of points and wraps them about an axis to create a geometry. I created an SVG parser which takes an SVG file and extracts the path to automatically create a geometry. This is how I constructed my tree.<br><br>I created the project for cardboard, but created a desktop version as well because of the differing navigational mental models.<\/p>",
			"cover": "img\/covers\/holidaycard.png",
			"tags":"Three.js holiday card made with 360 photos.",
			"previous":"",
			"client": "CMU MHCI",
			"next":"",
			"year":"2016",
			"demo":"../christmas2016",
			"filters":"development emerging-tech interaction-design ux-design",
			"featured":"inline",
			"color":"#cf514c",
			"duration":"3 Weeks",
			"brief":"This is a 360 photo holiday card I created as my final project for a course at CMU called Software Structures for Usable Interfaces.",
			"content1":"<div class=\"left\"><h1>About the Project</h1></div> <div class=\"right\"><p>For this project I was changed scoping a web-based project that would take three weeks to build and include course topics.<br><br>I decided to use three.js to create a holiday card to send to my family and friends using 360 photos I had taken throughout the year.<br><br>The primary class topic I focused on was library extension. Three.js has a lathe geometry object which takes a set of points and wraps them about an axis to create a geometry. I created an SVG parser which takes an SVG file and extracts the set of points to automatically create a lathe geometry. This is how I constructed my the Christmas tree.</p></div>",
			"content2":"<div class=\"left\"><h1>How it works</h1></div> <div class=\"right\"><p>When a user clicks on a Christmas ornament, the corresponding 360 photo becomes the background of the scene. When a user clicks each of the presents, a different song plays.<br><br>I implemented both a desktop and mobile version of the holiday card so that I could send this card to family members with various levels of tech savvy. <br><br>View the demo <a href=\"../christmas2016\">here</a>.</p></div>",
			"content3":"<div class=\"left\"><h1>Future Directions</h1></div> <div class=\"right\"><p>Right now, the card loads rather slowly because of all of the high resolution images. In the future, I would like to optimize it for faster loading so that I can add many more ornaments/photos. </p></div>",
			"section":"",
			"rec1":"",
			"rec2":""
		},{
			"index": "mickeymirror",
			"name": "Mickey Mirror 2.0",
			"url": "https:\/\/www.behance.net\/gallery\/20538895\/Mickey-Mirror",
			"video":"<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/McqPx7qup-c\" frameborder=\"0\" allowfullscreen></iframe>",
			"description": "Version 1.0<br><br><p>This is a software mirror I created for an interactive computing course. The prompt was to use video input to create an application.<br><BR>For this project, I wanted to create an experience that could be implemented in a theme park setting. Disneyland has a plethora of different \"ears\" that you can purchase throughout the park, but not all of them are available at each location. The objective of this project was to make an interactive interface that could be installed throughout the park for guests to order any hat and pick it up on their way out.<br><br><\/p><p>Version 2.0</p><br><p>In 2016, I decided to rework this experience as a modular photo booth based on feedback on the original project. I also reworked the codebase to make it easier for others to understand and adapt for their own uses. I was awarded the Delphix Diversity in Technology Scholarship for this piece.<\/p>",
			"cover": "img\/covers\/mickey.png",
			"tags":"Software mirror \/ photo booth for trying on \"mickey ears.\"",
			"previous":"",
			"next":"",
			"client": "NYU Courant",
			"year":"2013 / 2016",
			"github":"https://github.com/claremcarroll/Mickey-Mirror-Project",
			"filters":"development ux-design vis-design interaction-design",
			"featured":"none",
			"color":"#c40a0a",
			"awards":"Delphix Diversity in Computing Scholarship",
			"brief":"Mickey Mirror is an interactive software mirror for trying on and embroidering Mickey Mouse \"Ears\" at Disney Parks. The mirror also functions as a photo booth. This project was originally created for an interactive computing course at NYU in 2013 then redesigned for a scholarship competition in 2016.",
			"content1":"<div class=\"left\"><h1>Version 1.0</h1></div> <div class=\"right\"><p>The original prompt for this project was to use video input to create an application.<br><BR> I wanted to create an experience that could be implemented in a theme park setting. Disneyland has a plethora of different \"ears\" that you can purchase throughout the park, but not all of them are available at each location. My goal was to make an interactive interface that could be installed throughout the park for guests to order any hat and pick it up on their way out.<br><br><ol><li>First users see the Mickey Mirror and can try on different hats<br><br><img class=\" \" src=\"../img/mickey/mickey1-1.png\"> </li><li>Then users enter the text, font, and color for their embroidery.<br><br><img class=\"\" src=\"../img/mickey/mickey1-2.png\"></li><li>Finally, the users confirm their final creation!<br><br><img class=\" \" src=\"../img/mickey/mickey1-3.png\"></li><li>Users can also use this application as a photobooth.<br><br><img class=\" \" src=\"../img/mickey/mickey1-4.png\"></li></ol></p></div>",
			"content2":"<div class=\"left\"><h1>Version 2.0</h1></div> <div class=\"right\"><p>In 2016, I decided to rework this experience as a modular photo booth based on feedback on the original project. I also reworked the codebase to make it easier for others to understand and adapt for their own uses. I was awarded the Delphix Diversity in Technology Scholarship for this piece. <ol><li>Much like the original version, users first see the Mickey Mirror and can try on different hats.<br><br><img class=\" \" src=\"../img/mickey/mickey2-1.png\"> </li><li>By clicking on the gear icon, users can go to settings and apply a custom theme. Custom themes can be created using the illustrator template provided. Users then drag their custom hats into the corresponding folder.<br><br><img class=\"\" src=\"../img/mickey/mickey2-2.png\"></li><li>Then users have their custom photobooth! (Hopefully better looking than this one).<br><br><img class=\"\" src=\"../img/mickey/mickey2-3.png\"></li><li>Users can also drag and drop hats into the application. The current state of the application will be saved on close.<br><br><img class=\"\" src=\"../img/mickey/mickey2-4.png\"></li></ol></p></div>",
			"section":"",
			"github":"https://github.com/claremcarroll/Mickey2.0",
			"rec1":"",
			"rec2":""
		}, {
			"index": "genesisdiyed",
			"name": "Genesis DIYed",
			"url": "https:\/\/www.behance.net\/gallery\/20539775\/Genesis-DIYed",
			"video":"<iframe src=\"https://player.vimeo.com/video/81892131\" width=\"500\" height=\"281\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>",
			"description": "<p>A redundant augmented reality board project in which users can draw their own characters and scan them into a 3D universe. Built with Yuji Tsuchikawa and Rock Zou. Presented at the ITP Winter Showcase in 2013.</p>",
			"cover": "img\/covers\/genesis.png",
			"tags":"Augmented reality virtual universe created by drawing and scanning in characters.",
			"previous":"",
			"next":"",
			"year":"2013",
			"filters":"project-management development ux-design interaction-design emerging-tech",
			"featured":"none",
			"color":"#000000",
			"role":"Interaction Design, 3D Modelling, and Graphics Lead.",
			"demos":"ITP Winter Showcase 2013",
			"brief":"This is an augmented reality environment where users can draw and scan characters and manipulate the environment. ",
			"content1":"<div class=\"left\"><h1>How it works</h1></div> <div class=\"right\"><p>Using four AR markers, we created a defined physical AR space with redundancy so that users can put their hands onto the physical space. Using the same redundancy technique, we created a specialized drawing paper where users can draw their custom characters. Once held up to the camera, the whitespace is removed and the character is scanned into the environment. Using specified augmented reality markers, users can also manipulate the environment by planting trees, changing the world textures, and zooming in on a specific characters.</p></div>",
			"content2":"<div class=\"left\"><h1>The Experience</h1></div> <div class=\"right\"><p><ol><li>Draw your character onto the AR paper<br><br><img class=\"modalize\" src=\"../img/genesis/gen2.png\"><br><br><img class=\"modalize\" src=\"../img/genesis/gen3.png\"></li><li>Hold the paper up to the camera to scan the character into the environment<br><br><img class=\"modalize\" src=\"../img/genesis/gen4.png\"></li><li>Watch your character explore the environment and interact with other characters<br><br><img class=\"modalize\" src=\"../img/genesis/gen5.png\"><br><br><img class=\"modalize\" src=\"../img/genesis/gen6.png\"></li><li>Zoom in on your character to get a better view<br><br><img class=\"modalize\" src=\"../img/genesis/gen7.png\"><br><br><img class=\"modalize\" src=\"../img/genesis/gen8.png\"></li><li>Plant trees and change the texture of the environment<br><br><img class=\"modalize\" src=\"../img/genesis/gen9.png\"></li></ol></p></div>",
			"content3":"<div class=\"left\"><h1>Team</h1></div> <div class=\"right\"><div class=\" graphic-sub\"> <div class=\" img-container\"> <img src=\"../img/genesis/team1.jpg\"></div> <div class=\" img-container\"><img src=\"../img/genesis/team2.jpg\"></div><div class=\" img-container\"><img src=\"../img/genesis/team3.jpg\"></div></div><p><br>Rock Zou, Clare Carroll, and Yuji Tsuchikawa (from left to right).</p></div>",
			"section":"",
			"rec1":"",
			"rec2":""
		}

	]

}